Tekla.Structures.ModelInternal.BuildingHierarchy.Building.Bottom
Gets or sets a building bottom z-level.

Tekla.Structures.ModelInternal.BuildingHierarchy.Building.Height
Gets or sets a building height.

Tekla.Structures.ModelInternal.BuildingHierarchy.Building.GetStoreys
Gets all storeys belonging to this site.
Returns: All storeys belonging to this site.